app/views/homepage/_tab.html.erb

			<div class="tab-pane fade active in" id="<%= genre.name %>">
				<% @ran_products= Product.where(genre:genre.name).order("RANDOM()").limit(4)%>
---
SELECT  "products".* FROM "products" WHERE "products"."genre" = $1  ORDER BY RANDOM() LIMIT 4  [["genre", "Arcade"]]