app/controllers/accounts_controller.rb

SELECT  "accounts".* FROM "accounts"  WHERE "accounts"."id" = $1 LIMIT 1  [["id", 2]]
---
	def edit
		@account = Account.find(params[:id])

INSERT INTO "accounts" ("name", "email", "password", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "dien"], ["email", "dien@gmail.com"], ["password", "hhh"], ["created_at", "2015-03-23 11:52:29.989930"], ["updated_at", "2015-03-23 11:52:29.989930"]]
---
	def create
		@account = Account.new(account_params)
		if @account.save

SELECT  "accounts".* FROM "accounts" WHERE "accounts"."id" = $1 LIMIT 1  [["id", 5]]
UPDATE "accounts" SET "name" = $1, "password" = $2, "updated_at" = $3 WHERE "accounts"."id" = $4  [["name", "joe"], ["password", "aaa"], ["updated_at", "2015-03-25 03:50:49.558315"], ["id", 5]]
---
	def update
		@account = Account.find(params[:id])

		if current_user.name == @account.name || current_user.name == "admin"
			if @account.update(account_params)

SELECT  "accounts".* FROM "accounts"  WHERE "accounts"."id" = $1 LIMIT 1  [["id", 1]]
---
	def show
		@account = Account.find(params[:id])

SELECT "accounts".* FROM "accounts"
---
	def index
		if logged_in? && current_user.name == "admin"
			if params[:search]
				@accounts = Account.search(params[:search])

SELECT  "accounts".* FROM "accounts"  WHERE "accounts"."id" = $1 LIMIT 1  [["id", 1]]
DELETE FROM "accounts" WHERE "accounts"."id" = $1  [["id", 1]]
---
	def destroy
		@account = Account.find(params[:id])
		@account.destroy