app/controllers/coupons_controller.rb

SELECT "accounts".* FROM "accounts"
INSERT INTO "coupons" ("code", "date", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["code", "85012839138585184692293995957162775418"], ["date", "2015-05-17"], ["created_at", "2015-05-17 06:00:04.949272"], ["updated_at", "2015-05-17 06:00:04.949272"]]
---
  def create
    random_string = Random.new_seed;
    @coupon = Coupon.new;
    @coupon.code = random_string;
    @coupon.date = Time.now.strftime("%Y-%m-%d");

    @accounts = Account.all
    @accounts.each do |account|
      account.send_coupon_code(@coupon.code)
    end

    if @coupon.save

SELECT  "coupons".* FROM "coupons" WHERE "coupons"."id" = $1 LIMIT 1  [["id", 980190962]]
DELETE FROM "coupons" WHERE "coupons"."id" = $1  [["id", 980190962]]
---
  def destroy
    @coupon = Coupon.find(params[:id])
    @coupon.destroy