app/controllers/genres_controller.rb

SELECT "genres".* FROM "genres"
---
  def index
    if logged_in? && current_user.name == "admin"
      @genres = Genre.all

INSERT INTO "genres" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "Arcade"], ["created_at", "2015-03-23 11:26:04.470059"], ["updated_at", "2015-03-23 11:26:04.470059"]]
---
  def create
    @genre = Genre.new(genre_params)

    if @genre.save

SELECT  "genres".* FROM "genres" WHERE "genres"."id" = $1 LIMIT 1  [["id", 2]]
UPDATE "genres" SET "name" = $1, "updated_at" = $2 WHERE "genres"."id" = $3  [["name", "Action"], ["updated_at", "2015-03-27 13:51:14.685931"], ["id", 2]]
SELECT "products".* FROM "products"
UPDATE "products" SET "genre" = $1, "updated_at" = $2 WHERE "products"."id" = $3  [["genre", "Action"], ["updated_at", "2015-03-27 13:51:14.691933"], ["id", 7]]
---
  def update
    @genre = Genre.find(params[:id])
    old_genre = @genre.name
    if @genre.update(genre_params)
      @products = Product.all
      @products.each do |product|
        if product.genre == old_genre
          product.update_attributes(:genre => @genre.name)