app/controllers/homepage_controller.rb

SELECT "products".* FROM "products"
SELECT "genres".* FROM "genres"
SELECT  "products".* FROM "products"  ORDER BY "products"."id" DESC LIMIT 4
---
  def index
    @products = Product.all
    @genres = Genre.all
    @current = nil
    @count = nil
    @ran_products = nil
    @new_products = Product.all.last(4)

SELECT  "products".* FROM "products" WHERE "products"."id" = $1 LIMIT 1  [["id", 0]]
SELECT "ratings".* FROM "ratings" WHERE "ratings"."product_id" = $1  ORDER BY "ratings"."created_at" DESC  [["product_id", 980190962]]
---
  def show
    @genres = Genre.all
    @current = nil
    @count = nil
    @products = Product.all
    @product = Product.find(params[:id])
    $product = @product
    @orders = OrderItem.all

    # get all the comments of a product
    @product_ratings = Rating.where(product_id: @product.id).order(:created_at).reverse_order

SELECT "products".* FROM "products"
---
  def category
    @products = Product.all