app/controllers/orders_controller.rb

INSERT INTO "orders" ("account_id", "created_at", "order_date", "product_id", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["account_id", 1], ["created_at", "2015-03-19 17:31:20.483304"], ["order_date", "2015-03-19 17:31:20.469354"], ["product_id", 66], ["updated_at", "2015-03-19 17:31:20.483304"]]
---
	def create
		@order = current_user.orders.create(order_date: Time.now,
			product_id: params[:order][:product_id])