app/controllers/order_items_controller.rb

SELECT  "order_items".* FROM "order_items" WHERE "order_items"."id" = $1 LIMIT 1  [["id", 980190962]]
SELECT  "products".* FROM "products" WHERE "products"."id" = $1 LIMIT 1  [["id", 1]]
---
  def update
      @order_item = OrderItem.find(params[:id])
      @order_item.update_attributes(order_item_params)

      # send email to confirm delivered product
      prod = Product.find_by_id(@order_item.product_id)

SELECT  "order_items".* FROM "order_items" WHERE "order_items"."id" = $1 LIMIT 1  [["id", 980190962]]
DELETE FROM "order_items" WHERE "order_items"."id" = $1  [["id", 980190962]]
---
  def destroy
    @order_item = OrderItem.find(params[:id])
    @order_item.destroy