app/controllers/products_controller.rb

SELECT "genres"."name" FROM "genres"
SELECT "products".* FROM "products"
---
    def index
        if logged_in? && current_user.is_admin == true
            if params[:search]
                @genres = Genre.all.pluck(:name)
                @products = Product.search(params[:search], params[:type])

SELECT "genres"."name" FROM "genres"
---
    def new
        if logged_in? && current_user.is_admin == true
            @product = Product.new
            @genres = Genre.all.pluck(:name)

SELECT  "products".* FROM "products" WHERE "products"."id" = $1 LIMIT 1  [["id", 5]]
SELECT "genres"."name" FROM "genres"
---
    def edit
        if logged_in? && current_user.is_admin == true
            @product = Product.find(params[:id])
            @genres = Genre.all.pluck(:name)

SELECT "genres"."name" FROM "genres"
INSERT INTO "products" ("name", "genre", "des", "price", "img", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
    def create
        if logged_in? && current_user.is_admin == true
            @product = Product.new(product_params)
            @genres = Genre.all.pluck(:name)
            if @product.save

SELECT  "products".* FROM "products" WHERE "products"."id" = $1 LIMIT 1  [["id", 5]]
SELECT "genres"."name" FROM "genres"
UPDATE "products" SET "des" = $1, "updated_at" = $2 WHERE "products"."id" = $3  [["des", "First-person shooter game"], ["updated_at", "2015-03-28 10:29:10.225424"], ["id", 8]]
---
    def update
        if logged_in? && current_user.is_admin == true
            @product = Product.find(params[:id])
            @genres = Genre.all.pluck(:name)
            if @product.update(product_params)

SELECT  "products".* FROM "products" WHERE "products"."id" = $1 LIMIT 1  [["id", 4]]
DELETE FROM "products" WHERE "products"."id" = $1  [["id", 4]]
---
    def destroy
        if logged_in? && current_user.is_admin == true
            @product = Product.find(params[:id])

            @orders = OrderItem.where("product_id = ?", @product.id)
            @orders.each do |order|
                order.destroy
            end

            @ratings = Rating.where("product_id = ?", @product.id)
            @ratings.each do |rating|
                rating.destroy
            end

            @product.destroy