app/controllers/sessions_controller.rb

  def create
    name = Account.find_by(name: params[:session][:name])
    pass = Account.find_by(password: params[:session][:password])
---
SELECT  "accounts".* FROM "accounts"  WHERE "accounts"."name" = 'dien' LIMIT 1
SELECT  "accounts".* FROM "accounts"  WHERE "accounts"."password" = 'hhh' LIMIT 1